reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["url", ""], ["content", ""], ["author_id", 1], ["created_at", "2022-03-18 21:00:04.554429"], ["updated_at", "2022-03-18 21:00:04.554429"]]
---
  def create
    debugger
    @post = Post.new(post_params)
    @post.author = current_user

    # @post.post_subs.each {|post_sub| post_sub.post_id = @post.id}

    if @post.save