reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Rails 2 = very horrible"], ["updated_at", "2022-03-18 19:03:34.480830"], ["id", 1]]
---
  def update
    @sub  = Sub.find(params[:id])
    @sub.moderator_id = current_user.id

    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def is_moderator?
    @sub =  Sub.find(params[:id])